# جدول الامتحانات وتوزيع الغرف الخاص بهذه السنة/الترم
# عدّل القاموسين عند تجهيز سنة جديدة.
course_codes = {
    "حوسبة سحابية": "IS433_CS",
    "حوسبة سحابية": "IS433_IT",
    "حوسبة سحابية": "IS433_IS",
    "نظم تشغيل-2": "CS362",
}
# مواد الكلية بدون تكرار بالمشاريع
#70 مادة

raw_exam_schedule = {
    "IS433": ("الأربعاء", "2/9/2026", "الفترة الثانية (12:00 - 2:00)"),
    "CS362": ("الاثنين", "7/9/2026", "الفترة الثانية (12:00 - 2:00)"),
}

raw_room_schedule = {
    "IS433": [],                             # حوسبة سحابية
    # "IS433_CS": [],                             # حوسبة سحابية
    # "IS433_IT": [],                             # حوسبة سحابية
    # "IS433_IS": [],                             # حوسبة سحابية
    "CS362": [],                                   # نظم تشغيل-2
}
