# جدول الامتحانات وتوزيع الغرف الخاص بهذه السنة/الترم
# عدّل القاموسين عند تجهيز سنة جديدة.

course_codes = {
    "مبادئ إدارة": "OD112",
    "برمجة تطبيقات المحمول": "CS438",
    "موضوعات مختارة في نظم المعلومات": "IS381",

    "النمذجة والمحاكاة": "OD241",
    "برمجة حاسبات متقدمة": "CS437",
    "التطوير المتقدم للويب": "IT451",
    "نظم المعلومات الذكية": "IS361",

    "القضايا المجتمعية": "HM110",
    "أمن الحاسب": "CS415",
    "تأمين الشبكات": "IT418",
    "أمان المعلومات": "IS463",
    "هندسة البرمجيات 1": "CS251",

    "رياضيات-2": "MA112",
    "هندسة البرمجيات 2": "CS352",
    "الرسم بالحاسب": "IT341",
    "تحليل وتصميم نظم2": "IS313",

    "نظم تشغيل-1": "CS261",
    "نظم تشغيل-2": "CS362",
    "النظم الموزعة": "CS442",
    "الرؤية بالحاسب": "IT422",
    "تطبيقات تكنولوجيا المعلومات": "IT487",
    "البيانات الضخمة": "IS485",

    "مقدمة نظم معلومات": "IS111",
    "تحليل وتصميم الخوارزميات": "CS313",
    "حوسبة سحابية": "IS433",

    "تصميم وتطوير الويب": "IS251",
    "معالجة اللغات الطبيعية": "CS472",
    "الشبكات اللاسلكية والمتحركة": "IT416",

    "مبادئ برمجة": "CS131",
    "معالجة الصور": "IT321",
    "التعرف على الأنماط": "IT431",
    "أنظمة الشركات": "IS344",
    "نظم المعلومات الجغرافية": "IS464",
    "إدارة تحليل الشبكات": "IT315",

    "شبكات الحاسبات-1": "IT211",
    "البرمجة المتوازية": "CS443",
    "الواقع الافتراضي": "IT444",

    "مقدمة إلكترونيات": "IT181",
    "تعلم الآلة": "CS323",
    "استراتيجيات وإدارة واكتساب نظم المعلومات": "IS342",
    "الأعمال الإلكترونية": "IS372",
    "الذكاء الاصطناعي": "CS321",

    "رياضيات-1": "MA111",
    "تحليل وتصميم نظم": "IS212",
    "مقدمة في بحوث العمليات ودعم القرار": "OD213",
    "الكائنات الآلية": "CS426",
    "إدارة البيانات الموزعة": "IS432",

    "إحصاء واحتمالات": "ST190",
    "تنظيم الحاسبات": "IT282",
    "شبكات الحاسبات-3": "IT313",

    "هياكل بيانات": "CS212",
    "تخزين واسترجاع المعلومات": "IS352",
    "نظم قواعد البيانات الحديثة": "IS426",

    "مقدمة في الحاسبات": "CS111",
    "نظم قواعد المعرفة": "CS424",
    "إدارة المعرفة": "IS444",
    "التعرف على الكلام": "IT472",
    "نظم قواعد البيانات2": "IS322",

    "برمجة حاسبات2": "CS233",
    "برمجة حاسبات1": "CS132",
    "ذكاء الأعمال": "IS331",
    "اتصال الإنسان بالحاسب": "CS473",
    "المعلوماتية المجتمعية": "IS465",
    "موضوعات مختارة_1": "IT485",
    "المشروع2": "CS482.",
    "المشروع2": "IT482.",
    "المشروع2": "IS482.",
    "المشروع1": "IT482",
    "المشروع1": "IS482",
    "المشروع1": "CS482",
}
# مواد الكلية بدون تكرار بالمشاريع
#70 مادة

raw_exam_schedule = {
    "OD112": ("الأربعاء", "20/5/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS438": ("الأربعاء", "20/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS381": ("الأربعاء", "20/5/2026", "الفترة الثانية (12:00 - 2:00)"),

    "OD241": ("الخميس", "21/5/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS437": ("الخميس", "21/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT451": ("الخميس", "21/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS361": ("الخميس", "21/5/2026", "الفترة الثانية (12:00 - 2:00)"),

    "HM110": ("السبت", "23/5/2026", "الفترة الأولى (11:10)"),
    "CS415": ("السبت", "23/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT418": ("السبت", "23/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS463": ("السبت", "23/5/2026", "الفترة الثانية (12:00 - 2:00)"),
    "CS251": ("السبت", "23/5/2026", "الفترة الثانية (12:00 - 2:00)"),

    "MA112": ("الاثنين", "1/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS352": ("الاثنين", "1/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT341": ("الاثنين", "1/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS313": ("الاثنين", "1/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS261": ("الثلاثاء", "2/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS362": ("الثلاثاء", "2/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS442": ("الثلاثاء", "2/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT422": ("الثلاثاء", "2/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT487": ("الثلاثاء", "2/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS485": ("الثلاثاء", "2/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "IS111": ("الأربعاء", "3/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS313": ("الأربعاء", "3/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS433": ("الأربعاء", "3/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "IS251": ("الخميس", "4/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS472": ("الخميس", "4/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT416": ("الخميس", "4/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS131": ("السبت", "6/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IT321": ("السبت", "6/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT431": ("السبت", "6/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS344": ("السبت", "6/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS464": ("السبت", "6/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT315": ("السبت", "6/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "IT211": ("الأحد", "7/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS443": ("الأحد", "7/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT444": ("الأحد", "7/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "IT181": ("الاثنين", "8/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS323": ("الاثنين", "8/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS342": ("الاثنين", "8/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS372": ("الاثنين", "8/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "CS321": ("الاثنين", "8/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT485": ("الاثنين", "8/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "MA111": ("الثلاثاء", "9/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IS212": ("الثلاثاء", "9/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "OD213": ("الثلاثاء", "9/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS426": ("الثلاثاء", "9/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS432": ("الثلاثاء", "9/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "ST190": ("الأربعاء", "10/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IT282": ("الأربعاء", "10/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IT313": ("الأربعاء", "10/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS212": ("الخميس", "11/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IS352": ("الخميس", "11/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS426": ("الخميس", "11/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS111": ("السبت", "13/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS424": ("السبت", "13/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS444": ("السبت", "13/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IT472": ("السبت", "13/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS322": ("السبت", "13/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS233": ("الأحد", "14/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "CS132": ("الأحد", "14/6/2026", "الفترة الأولى (9:30 - 11:30)"),
    "IS331": ("الأحد", "14/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "CS473": ("الأحد", "14/6/2026", "الفترة الثانية (12:00 - 2:00)"),
    "IS465": ("الأحد", "14/6/2026", "الفترة الثانية (12:00 - 2:00)"),

    "CS482.": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)"), # المشروع
    "IT482.": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)"), # المشروع
    "IS482.": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)"), # المشروع
    "IT482": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)"), # المشروع
    "IS482": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)"), # المشروع
    "CS482": ("الاثنين", "29/6/2026", "الفترة الأولى (بدايةً من 9:30ص)") # المشروع
}

raw_room_schedule = {
    "CS415": [5, 5, 5, 5, 301, 302, 303],          # أمن الحاسب
    "IS463": [2, 2],                               # أمن المعلومات
    "IS444": [303, 305],                           # إدارة المعرفة
    "IS342": [2, 1],                               # استراتيجيات وإدارة واكتساب نظم المعلومات
    "IS372": [3],                                  # الأعمال الإلكترونية
    "IT431": [3],                                  # التعرف على الأنماط-1
    "IT472": [4, 4, 3],                            # التعرف على الكلام-1
    "CS321_CS": [3],                               # الذكاء الاصطناعي
    "CS321_IS": [3],                               # الذكاء الاصطناعي
    "IT341": [4, 4, 3],                            # الرسم بالحاسب-1
    "CS438": [4, 4, 3, 3, 202, 203],               # برمجة تطبيقات المحمول
    "IT418": [4, 4, 3],                            # تأمين الشبكات
    "IS313": [303],                                # تحليل وتصميم نظم-2
    "CS313": [5, 5, 5, 5, 4, 4, 3, 3, 202, 2, 1],  # تحليل وتصميم الخوارزميات
    "CS323": [5, 5, 5, 5, 202, 203],               # تعلم الآلة
    "IS433_CS": [203],                             # حوسبة سحابية
    "IS433_IT": [203],                             # حوسبة سحابية
    "IS433_IS": [203],                             # حوسبة سحابية
    "IT313": [2, 1, 1],                            # شبكات الحاسبات-3
    "IT321": [4, 4, 3],                            # معالجة الصور-1
    "IT451": [4, 4, 3, 3],                         # التطوير المتقدم للويب
    "IS381": [2],                                  # موضوعات مختارة في نظم المعلومات-1
    "IS322": [202, 203],                           # نظم قواعد البيانات-2
    "CS424": [5, 5, 5, 5, 301, 302],               # نظم قواعد المعرفة
    "CS352": [5, 5, 5, 5, 301, 302, 303],          # هندسة البرمجيات-2
    "CS251": [3],                                  # هندسة البرمجيات-1
    "IS352_CS": [5, 5, 5, 5, 4, 4, 3, 3],          # تخزين واسترجاع المعلومات
    "IS352_IS": [1, 1],                                # تخزين واسترجاع المعلومات
    "IS352_IT": [202, 203, 2],                                # تخزين واسترجاع المعلومات
    "OD112": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 4, 202, 203, 2, 1, 0],                                   # مبادئ إدارة
    "OD241": [5, 5, 5, 5, 301, 302, 303, 306, 4, 4, 3, 3, 2, 1, 1],                                   # النمذجة والمحاكاة
    "IS361": [2, 1],                                   # نظم المعلومات الذكية
    "HM110": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 202, 203, 2, 1, 0, 0],                                   # القضايا المجتمعية
    "MA112": [5, 5, 5, 5, 301, 302, 303, 306, 307, 4, 4, 3, 3, 202, 203, 2, 1],                                   # رياضيات-2
    "CS261": [5, 5, 5, 5, 301, 302, 303, 306, 307, 4, 4, 3, 3, 2],                                   # نظم تشغيل-1
    "CS362": [2],                                   # نظم تشغيل-2
    "CS442": [5, 5, 5, 5, 301, 302, 303],                                   # النظم الموزعة
    "IT422": [4, 4, 3],                                   # الرؤية بالحاسب
    "IT487": [1],                                   # تطبيقات تكنولوجيا المعلومات
    "IS485": [2, 1],                                   # البيانات الضخمة
    "IS111": [-1, 5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 202, 203, 2, 1, 0, 0],                                   # مقدمة نظم معلومات
    "IS251": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 2],                                   # تصميم وتطوير الويب
    "CS472": [5, 5, 5, 5, 4, 4, 3],                                   # معالجة اللغات الطبيعية
    "IT416": [202, 203, 1, 1],                                   # الشبكات اللاسلكية والمتحركة
    "CS131": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 2, 2, 1],                                   # مبادئ برمجة
    "IS344": [1],                                   # أنظمة الشركات
    "IS464": [2, 2],                                   # نظم المعلومات الجغرافية
    "IT315": [1],                                   # إدارة تحليل الشبكات
    "IT211": [5, 5, 5, 5, 301, 302, 303, 305, 4, 4, 3, 3, 2, 1],                                   # شبكات الحاسبات-1
    "CS443": [2],                                   # البرمجة المتوازية
    "IT444": [2],                                   # الواقع الافتراضي
    "IT181": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 202, 203, 1],                                   # مقدمة إلكترونيات
    "MA111": [4, 4, 3, 3, 202, 203],                                   # رياضيات-1
    "IS212": [203],                                   # تحليل وتصميم نظم
    "OD213": [203],                                   # مقدمة في بحوث العمليات ودعم القرار
    "CS426": [4, 4, 3, 3, 202, 203, 1],                                   # الكائنات الآلية
    "IS432": [1, 2],                                   # إدارة البيانات الموزعة
    "ST190": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 202, 203, 2, 1],                                   # إحصاء واحتمالات
    "IT282": [1],                                   # تنظيم الحاسبات
    "CS212": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3, 202],                                   # هياكل بيانات
    "IS426": [3],                                   # نظم قواعد البيانات الحديثة
    "CS111": [4, 4, 3, 3, 2, 1],                                   # مقدمة في الحاسبات
    "CS473": [2],                                   # اتصال الإنسان بالحاسب
    "IS465": [2],                                   # المعلوماتية المجتمعية
    "IT485": [4, 4, 3, 3],                                   # موضوعات مختارة_1
    "CS437": [5, 5, 5, 5, 301, 302, 303],                                   # برمجة حاسبات متقدمة
    "IS331": [2],                                   # ذكاء الأعمال
    "CS132": [2, 1],                                   # برمجة حاسبات1
    "CS233": [5, 5, 5, 5, 301, 302, 303, 305, 306, 307, 4, 4, 3, 3],                                   # برمجة حاسبات2
    
    "CS482.": [-2], # المشروع
    "IT482.": [-2], # المشروع
    "IS482.": [-2], # المشروع
    "IT482": [-2], # المشروع
    "IS482": [-2], # المشروع
    "CS482": [-2] # المشروع
    }
